samimasad/STE-LPC1768-/My_Example_With_Drivers/board/sensor.c
// ============================================================================
// sensor.c
// ============================================================================
//  Created on: Dec 7, 2012
//      Author: Ruud Hendricksen
// ============================================================================


#include "lpc17xx.h"
#include "half.h"
#include "lpc17xx_ssp.h"
#include "FreeRTOS.h"
#include "task.h"
#include "board.h"
#include "lpc17xx_gpio.h"
#include "lpc17xx_pinsel.h"
#include "sensor.h"
// Global variables

int mode           = MODE_SEN300;
int ldo_ovr        = 0;
int factory_status = 0;
SSP_DATA_SETUP_Type xferConfig;
static char buf[40];

// External function prototypes
#if 0
extern void modem_debug( char * dbg );
extern void modem_error( char * dbg );
extern void modem_send_text( char * token, char * val );
#endif
// ============================================================================
// LOW LEVEL SPI FUNCTIONS
// ============================================================================




/**
* Select/Deselect the sensor chip.
*/
static void sensor_spichipselect( int select ) {

#if 0
	//not needed , LPC will take care of chip select
  if ( select ) {
    gpio_clr( SENSORSSEL_PORTPIN );
  } else {
    gpio_set( SENSORSSEL_PORTPIN );
  }
#else
	//GPIO_SetDir(0, 1L<<GPIO_CS , 1);
  static int first = 1;
  	  if ( first ) {
  	    first = 0;
  	    //gpio_alloc( SENSORRESET_PORTPIN, PCB_MODE_PULLUP, GPIO_OUTPUT );

  		//set the enable pin to output but put it to high initially

  	  GPIO_SetDir(0, 1L<<GPIO_CS , 1);


  	  }
	if(select)
	{
		//get enable signal to low

		GPIO_ClearValue(0 , 1L<<GPIO_CS);





	}
	else
	{
		//get it to high
		GPIO_SetValue(0 , 1L<<GPIO_CS);
		//GPIO_ClearValue(0 , 1L<<GPIO_RESET);



	}
#endif
}

/**
* Configures the SPI bus using the specific platform defines
*/
void sensor_spiconfigure( void ) {
  static int done = 0;
  if ( !done ) {
	  SSP_CFG_Type config ;
	  SSP_ConfigStructInit(&config);
	  //config.CPOL = 1 ;
	  //config.CPHA = 1 ;
	  config.CPOL = 0 ;
	  config.CPHA = 0 ;
	  config.ClockRate = 1000000 ;
	  config.Databit =  SSP_DATABIT_16 ;
	  //config.Databit =  SSP_DATABIT_8;
	  SSP_Init(PLATFORM_SPIBUS,&config);
	  SSP_Cmd(PLATFORM_SPIBUS, ENABLE);

	//ssp_Init(PLATFORM_SPIBUS, 1, 1);             // bus, cpol, cpha : SSP0 on LPC1343
    //ssp_SetSpeed(PLATFORM_SPIBUS, 1000000 );     // bus, bitrate    : SSP0 on LPC1343
    
    //gpio_alloc( SENSORSSEL_PORTPIN, PCB_MODE_PULLUP, GPIO_OUTPUT );
    done = 1;
  }
  //sensor_spichipselect( 0 );
  //sensor_spichipselect( 1 );
}

/**
* Send 16 bits over the SPI bus.
*/
static void sensor_spisend16(int val) {
	//uint8_t buf[2];
	//buf[0] = (val >> 8) & 0xFF;
	//buf[1] = val & 0xFF;
	uint16_t data,dummy ;
	data = (uint16_t) val ;
#if 1
	taskENTER_CRITICAL();
	sprintf( buf, "\r\nsensor_spisend16 Status = %x with data %x and data>>8 %x", PLATFORM_SPIBUS->SR,data,data>>8 );
	    //modem_debug( buf );
	//console_uart_sendString(buf);
	while(SSP_GetStatus(PLATFORM_SPIBUS,SSP_STAT_TXFIFO_NOTFULL) == RESET);
	SSP_SendData(PLATFORM_SPIBUS,data);
	while(SSP_GetStatus(PLATFORM_SPIBUS,SSP_STAT_RXFIFO_NOTEMPTY) == RESET);
		dummy = SSP_ReceiveData(PLATFORM_SPIBUS);
	while(SSP_GetStatus(PLATFORM_SPIBUS,SSP_STAT_TXFIFO_NOTFULL) == RESET);
	SSP_SendData(PLATFORM_SPIBUS,data>>8);

	/* Whenever a byte is written, MISO FIFO counter increments, Clear FIFO
		  on MISO. Otherwise, when SSP0Receive() is called, previous data byte
		  is left in the FIFO. */
	while(SSP_GetStatus(PLATFORM_SPIBUS,SSP_STAT_RXFIFO_NOTEMPTY) == RESET);
	dummy = SSP_ReceiveData(PLATFORM_SPIBUS);
	taskEXIT_CRITICAL();
#else
	xferConfig.tx_data = &data ;
	xferConfig.rx_data = &dummy;
	xferConfig.length = 1; //one word
	SSP_ReadWrite(PLATFORM_SPIBUS, &xferConfig, SSP_TRANSFER_POLLING);
#endif
/*
 ssp_Lock(PLATFORM_SPIBUS);
 ssp_Send(PLATFORM_SPIBUS, buf, 2);
 ssp_Unlock(PLATFORM_SPIBUS);
 */
}

/**
* Receive 16 bits from the SPI bus and return them in an integer.
*/
static int sensor_spireceive16( void ) {

	 /*
	  uint8_t buf[2];

  ssp_Lock(PLATFORM_SPIBUS);
  ssp_Receive(PLATFORM_SPIBUS, buf, 2, 0);
  ssp_Unlock(PLATFORM_SPIBUS);
  */
	uint16_t data,dummy ;
#if 1
	taskENTER_CRITICAL();
	sprintf( buf, "\r\nsensor_spireceive16 Status = %x ", PLATFORM_SPIBUS->SR );
	    //modem_debug( buf );
	//console_uart_sendString(buf);

	PLATFORM_SPIBUS->DR = 0xFF;
	while(SSP_GetStatus(PLATFORM_SPIBUS,SSP_STAT_RXFIFO_NOTEMPTY) == RESET);
	data = SSP_ReceiveData(PLATFORM_SPIBUS);
    sprintf( buf, "\r\nSSP_ReceiveData = %x ", data );
    //modem_debug( buf );
    //console_uart_sendString(buf);
	taskEXIT_CRITICAL();
	/*
  unsigned int ret = 0;
  ret |= ( buf[0] << 8 );
  ret |= buf[1];
  */
#else
	xferConfig.tx_data = &dummy ;
	xferConfig.rx_data = &data;
	xferConfig.length = 1; //one word
	SSP_ReadWrite(PLATFORM_SPIBUS, &xferConfig, SSP_TRANSFER_POLLING);
#endif
  return( (int)data );
}

// ============================================================================
// LOW LEVEL SENSOR FUNCTIONS
// ============================================================================

#define CLK_STATE_NONE    0
#define CLK_STATE_TIMER   1
#define CLK_STATE_ZERO    2

/**
* Controls the clock to the sensor (1 MHz to MIST1431, LOW to SenX00)
*/
static void sensor_sensorclk( int enable ) {

	//GPIO_SetDir(0, 1L<<GPIO_RESET , 1);
	static int first = 1;
	  if ( first ) {
	    first = 0;
	    //gpio_alloc( SENSORRESET_PORTPIN, PCB_MODE_PULLUP, GPIO_OUTPUT );

		//set the enable pin to output but put it to high initially

	    GPIO_SetDir(0, 1L<<GPIO_RESET , 1);


	  }
	if(enable)
	{
		//get enable signal to low

		GPIO_ClearValue(0 , 1L<<GPIO_RESET);





	}
	else
	{
		//get it to high
		GPIO_SetValue(0 , 1L<<GPIO_RESET);
		//GPIO_ClearValue(0 , 1L<<GPIO_RESET);



