samimasad/STE-LPC1768-/My_Example_With_Drivers/board/sensor.c
	}




#if 0
  static int clk_state = CLK_STATE_NONE;

  if ( mode == MODE_MIST1431 ) {
    if ( clk_state == CLK_STATE_ZERO ) gpio_free( CLK_TIMER_PORTPIN );
    
    if ( enable && ( clk_state != CLK_STATE_TIMER ) ) {
	  CLKOUTDIV=clk_get_cclk()/1000000; // enable, 1mhz
      clk_state = CLK_STATE_TIMER;
    } else if ( clk_state == CLK_STATE_TIMER ) {
	  CLKOUTDIV=0; // disable
      clk_state = CLK_STATE_NONE;
    }
  }

  else {
    if ( clk_state == CLK_STATE_TIMER ) CLKOUTDIV=0; // disable
    
    if ( clk_state != CLK_STATE_ZERO ) {
      gpio_alloc( CLK_TIMER_PORTPIN, PCB_MODE_PULLUP, GPIO_OUTPUT );
      gpio_clr( CLK_TIMER_PORTPIN ); 
      clk_state = CLK_STATE_ZERO;
    }
  }
#endif

}

/**
* Controls if sensor is in reset
*/
static void sensor_sensorreset( int enable ) {
  static int first = 1;
  if ( first ) {
    first = 0;
    //gpio_alloc( SENSORRESET_PORTPIN, PCB_MODE_PULLUP, GPIO_OUTPUT );

	//set the enable pin to output but put it to high initially

    GPIO_SetDir(0, 1L<<GPIO_RESET , 1);


  }
  //if ( enable ) gpio_clr( SENSORRESET_PORTPIN );
  //else gpio_set( SENSORRESET_PORTPIN );
  if ( enable )
  {
	  GPIO_ClearValue(0 , 1L<<GPIO_RESET);
  }
  else
  {
	  GPIO_SetValue(0 , 1L<<GPIO_RESET);
  }

}

/**
* Returns the status of the SINT pin of the sensor
*/
static int sensor_interrupt() {
  static int first = 1;
  if ( first ) {
    first = 0;
    //gpio_alloc( SENSORINT_PORTPIN, PCB_MODE_PULLUP, GPIO_INPUT );

    GPIO_SetDir(0, 1L<<GPIO_INT , 0);

  }
  //return( gpio_getval( SENSORINT_PORTPIN ) );
  if((GPIO_ReadValue(0) &  1L<<GPIO_INT))
  {
	  //sprintf( buf, "\r\nSensor sensor_interrupt results %x", GPIO_ReadValue(0) );
	  sprintf( buf, "\r\nSensor sensor_interrupt masked results %x", GPIO_ReadValue(0)&  1L<<GPIO_INT );
	  //modem_debug( buf );
	  //console_uart_sendString(buf);
  }
  return(GPIO_ReadValue(0) &  1L<<GPIO_INT );

}

// ============================================================================
// LOW LEVEL FUNCTIONS
// ============================================================================

/**
* Wait until sensor drives the SINT line HIGH.
* - Returns 0 when a timeout occurs.
*/
static int sensor_waitforinterrupt( void ) {
  int timeout = 50;
  //while ( !sensor_interrupt() && ( --timeout >= 0 ) ) rtk_tsk_sleep(10);    // 1);
  while ( !sensor_interrupt() && ( --timeout >= 0 ) ) vTaskDelay(10);    // 1);
  if(timeout <= 0){
	  sprintf( buf, "\r\nsensor_waitforinterrupt timeout %d", timeout );
	  //modem_debug( buf );
	  console_uart_sendString(buf);
  }

  return( timeout >= 0 );
}

/**
* Wait for sensor to be ready to receive a new command (drives the SINT line LOW).
* - Returns 0 when a timeout occurs.
*/
static int sensor_waitforreadytoreceive( void ) {
  int timeout = 50;
  //while ( sensor_interrupt() && ( --timeout >= 0 ) ) rtk_tsk_sleep(10);    // 1);
  while ( sensor_interrupt() && ( --timeout >= 0 ) ) vTaskDelay(10);    // 1);
  if(timeout <= 0){
	  sprintf( buf, "\r\nsensor_waitforreadytoreceive timeout %d", timeout );
	  //modem_debug( buf );
	  console_uart_sendString(buf);
  }
  return( timeout >= 0 );
}

/**
* Hard reset of sensor wit the RESETN line.
* - Also control the sensor clock
* - And catches the first Status report of the sensor into a global variable
*/
void sensor_hardreset( int on ) {
  if ( on ) {
    sensor_sensorclk( 0 );
    vTaskDelay(2);
    sensor_sensorreset( 1 ) ;
  } else {
    //rtk_tsk_sleep( 2 );
	vTaskDelay(2);
    sensor_sensorreset( 0 ) ;
    
    // When reset is gone, clock starts automatically on SENx00, but must be 
    // done manually for MIST1431
    sensor_sensorclk( 1 );
    // Give clock some time
    //rtk_tsk_sleep( 2 );
    vTaskDelay(2);
    
    // When there has been a reset (POR or SW driven), then the sensor expects
    // the host to read 16-bit and this is the Sensor IC status.
    // Once the status is read, then SINT will go low, which will suggest that
    // the Sensor is accepting commands.
    if ( sensor_waitforinterrupt() ) {
      sensor_spichipselect( 1 );
      factory_status = sensor_spireceive16();
      sensor_spichipselect( 0 );
    }
  }
}

// ============================================================================
// SPI LEVEL COMMAND FUNCTIONS
// ============================================================================

/**
* Send a Sensor command and wait for the response.
* - Return the 16-bit response as an integer.
* - Returns 1 on success.
*/
static int sensor_response( int numcmd, int * command, int * response ) {
  int ok = 0;
  int i;


//dio_printf( DIO_VUART0, "111\n");
  
  // Select the Sensor SPI device
  sensor_spichipselect( 1 );

//dio_printf( DIO_VUART0, "222\n");
  
  //if ( sensor_waitforreadytoreceive() ) {
    
//dio_printf( DIO_VUART0, "333\n");

    // Send command word(s) over SSP
    for ( i=0; i<numcmd; i++ ) {
      sensor_spisend16( command[i] );
    }
    
//dio_printf( DIO_VUART0, "444\n");

    // After sending the command, de-select the Sensor SPI device ...
    //vTaskDelay(10);
    sensor_spichipselect( 0 );
    //vTaskDelay(10);
//dio_printf( DIO_VUART0, "555\n");

    // ... and wait for the sensor to respond ...
    if ( sensor_waitforinterrupt() ) {
//    if ( 1 ) { vTaskDelay(1000);
//      dio_printf( DIO_VUART0, "666\n");

      // Select the Sensor SPI device to read the response
      sensor_spichipselect( 1 );
      
//dio_printf( DIO_VUART0, "777\n");

      // Read response over SSP
      *response = sensor_spireceive16();

      ok = 1;
      
//dio_printf( DIO_VUART0, "888\n");

      // Wait for the command to completely finish
    //  if ( sensor_waitforreadytoreceive() ) {
        // Cycle finished
//dio_printf( DIO_VUART0, "999\n");

     // }
      //else modem_debug( "error" );  // Missing SINT low at cycle-end
   //   else console_uart_sendString(  "\r\nerror" );
      
