samimasad/STE-LPC1768-/My_Example_With_Drivers/board/sensor.c
    }
//dio_printf( DIO_VUART0, "000\n");

  //}
  
  // After reading the data, de-select the Sensor SPI device
  sensor_spichipselect( 0 );

//    if        ( numcmd == 1 ) {
//      sprintf( buf, ", %2x, %2x,     ,     , %4x, ", command[0] >> 8, command[0] & 0xFF, *response );
//    } else if ( numcmd == 2 ) {
//      sprintf( buf, ", %2x, %2x, %4x,     , %4x", command[0] >> 8, command[0] & 0xFF, command[1], *response );
//    } else if ( numcmd == 3 ) {
//      sprintf( buf, ", %2x, %2x, %4x, %4x, %4x", command[0] >> 8, command[0] & 0xFF, command[1], command[2], *response );
//    } else {
//      sprintf( buf, "??" );
//    }
//    modem_send_text( "c", buf );

  
  return( ok );
}

// ============================================================================
// COMMAND FUNCTIONS
// ============================================================================

/**
* Print Command error.
*/
static void sensor_printcommanderror( int command ) {
  sprintf( buf, "\r\nSensor error on command %x", command );
  //modem_debug( buf );
  console_uart_sendString(buf);
}

/**
* Send a Sensor command.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_sendcommand( int command, int * response ) {
  int ok = sensor_response( 1, &command, response );
  if ( !ok ) sensor_printcommanderror( command );
  return( ok );
}

/**
* Send a Sensor command with 1 additional 16-bit parameter.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_sendcommand1( int command, int data, int * response ) {
  int cmd[2];
  cmd[0] = command;
  cmd[1] = data;
  int ok = sensor_response( 2, cmd, response );
  return( ok );
}

/**
* Send a Sensor command with 2 additional 16-bit parameters.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_sendcommand2( int command, int data1, int data2, int * response ) {
  int cmd[3];
  cmd[0] = command;
  cmd[1] = data1;
  cmd[2] = data2;
  int ok = sensor_response( 3, cmd, response );
  return( ok );
}

// ============================================================================
// HIGH-LEVEL COMMAND FUNCTIONS
// ============================================================================

/**
* Perform a soft Sensor reset.
*/
void sensor_command_reset( void ) {
  int cmd = ( CMD_RESET << 8 );
  int response;
  if ( sensor_sendcommand( cmd, &response ) ) {
    sprintf( buf, "\r\nSensor Reset: status = 0x%x", response );
    //modem_debug( buf );
    console_uart_sendString(buf);
  }
}

/**
* Request the Sensor status.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_command_status( int * pstatus ) {
  int cmd = ( CMD_STATUS << 8 );
  int response;
  if ( sensor_sendcommand( cmd, &response ) ) {
    sprintf( buf, "\r\nSensor Status : status = 0x%x", response );
    //modem_debug( buf );
    console_uart_sendString(buf);
    if ( pstatus ) *pstatus = response;
    return( 1 );
  }
  return( 0 );
}

// ============================================================================
// GENERIC SENSOR FUNCTIONS
// ============================================================================

/**
* Converts standard response into a string
*/
char * response2text( int response )
{
  static char smallbuf[8];
  if ( response == 0xac00 ) return( "OK" );
  sprintf( smallbuf, "\r\n0x%04x", response );
  return( smallbuf );
}

/**
* Power the analogue supply to the Sensors.
* - Returns 1 on success.
* - On SenX00, analog power supply should never be switched off
*/
int sensor_analogpower( int on ) {
  if ( mode == MODE_MIST1431 ) {
    int cmd = ( CMD_POWER_LEVEL << 8 );
    if ( ldo_ovr ) {
      cmd |= ( on ) ? ANALOG_POWER_ON : ANALOG_POWER_OFF;
    } else {
      int ldo_ana = ( factory_status >> 9 ) & 0x07;
      cmd |= ( ldo_ana << 1 );
      cmd |= ( on ) ? 0 : 1;
    }
    int response = 0;
    if ( sensor_sendcommand( cmd, &response ) ) {
      sprintf( buf, "\r\nAnalog power %s: %s", ((on)?"ON":"OFF"),
              response2text(response) );
      //modem_debug( buf );
      console_uart_sendString(buf);
    }
    return( response == RSP_ACK );
  }
  return( 1 );
}

/**
* Power a Sensor.
* - Returns 1 on success.
*/
int sensor_sensorpower( int sensor, int on ) {
  int cmd = ( on ) ? CMD_SENSOR_POWER : CMD_SENSOR_SHUTDOWN;
  cmd = ( cmd << 8 ) | sensor;
  int response = 0;
  if ( sensor_sendcommand( cmd, &response ) ) {
    sprintf( buf, "\r\nPowering S%d %s (0x%x): %s", sensor, ((on)?"ON":"OFF"),
            cmd, response2text(response) );
    //modem_debug( buf );
    console_uart_sendString(buf);
  }
  return( response == RSP_ACK );
}

/**
* Sets-up a Sensor.
* - Returns 1 on success.
*/
int sensor_sensorsetup( int sensor, int reg, int data ) {
  int cmd = ( CMD_SENSOR_SETUP << 8 ) | sensor;
  int response = 0;
  if ( sensor_sendcommand2( cmd, reg, data, &response ) ) {
    sprintf( buf, "\r\nSetting-up S%d (0x%x,0x%x): %s",
            sensor, reg, data, response2text(response) );
    //modem_debug( buf );
    console_uart_sendString(buf);
  }
  return( response == RSP_ACK );
}

/**
* Start a Sensor Conversion.
* - Returns 1 on success.
*/
int sensor_sensorstart( int sensor ) {
  int cmd = ( CMD_SENSOR_START << 8 ) | sensor;
  int response = 0;
  if ( sensor_sendcommand( cmd, &response ) ) {
    sprintf( buf, "\r\nStarting S%d: %s", sensor, response2text(response) );
    //modem_debug( buf );
    console_uart_sendString(buf);
  }
  return( response == RSP_ACK );
}

/**
* Check if a sensor conversion is ready by checking the irq flags
*/
int sensor_conversionready( int sensor ) {
  int irq_mask, status;
  
  switch (sensor) {
  case SENSOR_ADC:  irq_mask = 0x8000; break;
  case SENSOR_ALS:  irq_mask = 0x4000; break;
  case SENSOR_RH:   irq_mask = 0x2000; break;
  case SENSOR_TEMP: irq_mask = 0x1000; break;
  default: return( 0 );
  }
  
