samimasad/STE-LPC1768-/My_Example_With_Drivers/board/sensor.c
  sensor_command_status( &status );
  
  return( ( status & irq_mask ) != 0 );
}

/**
* Wait until a Sensor is ready.
* - Returns 0 when a timeout occurs.
*/
int sensor_waitforconversion( int sensor, int timeout ) {
  
  while ( timeout > 0 && !sensor_conversionready(sensor) ) {
    timeout -= 5;
    //rtk_tsk_sleep( 5 );
    vTaskDelay(5);
  }
  
  return( timeout > 0 );
}

/**
* Read status from a Sensor.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_readstatus( int sensor, int * pstatus ) {
  int cmd = ( CMD_SENSOR_STATUS << 8 ) | sensor;
  int response = 0;
  if ( sensor_sendcommand( cmd, &response ) ) {
    sprintf( buf, "\r\nReading S%d: status = 0x%x", sensor, response );
    //modem_debug( buf );
    console_uart_sendString(buf);
    if ( pstatus ) *pstatus = response;
    return( 1 );
  }
  return( 0 );
}

/**
* Read data from a Sensor.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_readdata( int sensor, int * data ) {
  int cmd = ( CMD_SENSOR_READ_OP << 8 ) | sensor;
  int response = 0;
  if ( sensor_sendcommand( cmd, &response ) ) {
    sprintf( buf, "\r\nReading S%d: data = 0x%x", sensor, response );
    //modem_debug( buf );
    console_uart_sendString(buf);
    *data = response;
    return( 1 );
  }
  return( 0 );
}

/**
* Read one 16-bit value from the NVM at a certain address.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
int sensor_readnvm( int addr, uint16_t * data ) {
  int cmd = ( CMD_NVMEM_READ << 8 ) | addr;
  int response = 0;
  if ( sensor_sendcommand( cmd, &response ) ) {
    *data = response;
    sprintf( buf, "\r\nNVM[%02x] = 0x%x (r)", addr, (volatile uint16_t *)*data );
    //modem_debug( buf );
    console_uart_sendString(buf);
    return( 1 );
  }
  return( 0 );
}

/**
* Write one 16-bit value to the NVM at a certain address.
*/
int sensor_writenvm( int addr, uint16_t data ) {
  int cmd = ( CMD_NVMEM_WRITE << 8 ) | addr;
  int response = 0;
  if ( sensor_sendcommand1( cmd, data, &response ) ) {
    sprintf( buf, "\r\nNVM[%02x] = 0x%x (w) : %s",
            addr, data, response2text(response) );
    //modem_debug( buf );
    console_uart_sendString(buf);
  }
  return( response == RSP_ACK );
}

/**
* Read one 16-bit value from the NVM at a certain address.
* - Return the 16-bit response via the (int) reference parameter.
* - Returns 1 on success.
*/
//int sensor_readapb( int addr, uint16_t * data ) {
//  int cmd = ( CMD_APB_READ << 8 ) | addr;
//  int response = 0;
//  if ( sensor_sendcommand( cmd, &response ) ) {
//    *data = response;
//    sprintf( buf, "NVM[%02x] = 0x%x (r)", addr, (volatile uint16_t *)*data );
//    modem_debug( buf );
//    return( 1 );
//  }
//  return( 0 );
//}
int sensor_readapb( int addr, uint16_t * data ) {
  int cmd = ( CMD_APB_READ << 8 );
  int response = 0;
  if ( sensor_sendcommand1( cmd, addr, &response ) ) {
    *data = response;
    sprintf( buf, "\r\nNVM[%02x] = 0x%x (r)", addr, (volatile uint16_t *)*data );
    //modem_debug( buf );
    console_uart_sendString(buf);
    return( 1 );
  }
  return( 0 );
}

/**
* Write one 16-bit value to the NVM at a certain address.
*/
int sensor_writeapb( int addr, uint16_t data ) {
  int cmd = ( CMD_APB_WRITE << 8 );
  int response = 0;
  if ( sensor_sendcommand2( cmd, addr, data, &response ) ) {
    sprintf( buf, "\r\nNVM[%02x] = 0x%x (w) : %s",
            addr, data, response2text(response) );
    //modem_debug( buf );
    console_uart_sendString(buf);
  }
  return( response == RSP_ACK );
}

// ============================================================================
// NVM SPECIFIC FUNCTIONS
// ============================================================================

int       CalibRead = 0;
uint16_t  Calib[56] ;

/**
* Read all MIST calibration values in one go (see Table 58).
* - Results are stored in the global array Calib.
* - Returns 1 on success.
*/
int MistNvmReadCalib( void ) {
  int addr = 0x40;
  uint16_t *pCalib;
  
  pCalib = Calib;
  while ( addr < 0x78 && sensor_readnvm( addr, pCalib ) ) {
    addr++;
    pCalib++;
  }
  if ( addr < 0x78 ){
    //modem_debug( "Error reading calibration values from NVM" );
	  console_uart_sendString("\r\nError reading calibration values from NVM" );
    return( 0 );
  }
  
  CalibRead = 1;
  return( 1 );
}

// ============================================================================
// NVM DATASHEET SECTION
// ============================================================================
// Address 20 contains typenumber in hex
// Address 21 contains subtypenumber in hex
// Address 22 contains first 4 digits of 12 nc
// Address 23 contains middle 4 digits of 12 nc
// Address 24 contains last 4 digits of 12 nc
//
// So SEN300/01 with 12nc 9352 991 54115 becomes
// 20 -> 0300h
// 21 -> 0001h
// 22 -> 9352h
// 23 -> 9915h
// 24 -> 4115h
//
// So SEN200/01 with 12nc 9353 006 43115 becomes
// 20 -> 0200h
// 21 -> 0001h
// 22 -> 9353h
// 23 -> 0064h
// 24 -> 4115h
// ============================================================================

#define NVM_DATASHEET  0x20

char buf12nc[16];

uint16_t nvm_readtype( void ) {
  // Assumes that sensor is active
  uint16_t typenumber;
  sensor_readnvm( NVM_DATASHEET + 0, &typenumber );
  return( typenumber );
}

uint16_t nvm_readsubtype( void ) {
  // Assumes that sensor is active
  uint16_t subtypenumber;

  sensor_readnvm( NVM_DATASHEET + 1, &subtypenumber );
  return( subtypenumber );
}

char * nvm_read12nc( void ) {
  // Assumes that sensor is active
  uint16_t fourchars;
  int i,j;
  for ( i=0; i<3; i++ ) {
    sensor_readnvm( NVM_DATASHEET + 2 + i, &fourchars );
    for (j=0; j<4; j++ ) {
      buf12nc[ (4*i) + j ] = ( ( fourchars >> ( ( 3-j ) * 4 ) ) & 0xf ) + '0';
    }
    buf12nc[12] = '\0';
  }
  return( buf12nc );
}

void nvm_detecttest( void ) {
  // Assumes that sensor is active
  
//  // SEN200/01 with 12nc 9353 006 43115 becomes
//  sensor_writeapb( 0x20, 0x0200 );   // Type
//  sensor_writeapb( 0x21, 0x0001 );   // Subtype
//  sensor_writeapb( 0x22, 0x9353 );
//  sensor_writeapb( 0x23, 0x0064 );
//  sensor_writeapb( 0x24, 0x3115 );
  
  // SEN200/01 with 12nc 9353 006 43115 becomes
  sensor_writeapb( 0x20, 0x0300 );   // Type
  sensor_writeapb( 0x21, 0x0001 );   // Subtype
  sensor_writeapb( 0x22, 0x9353 );
  sensor_writeapb( 0x23, 0x9915 );
  sensor_writeapb( 0x24, 0x4115 );
}

// ============================================================================
// TEMP SPECIFIC FUNCTIONS
// ============================================================================

/**
* Set-up the TEMP sensor.
* - Returns the (expected) conversion time when started (or -1 on error).
*/
int sensor_temp_setsensor( int numofbits ) {
    // conversion t  3  4  5  6  7   8   9   10 bits
    int delays[] = { 0, 0, 0, 0, 2, 15, 50, 100 };
    if ( numofbits >= 3 && numofbits <= 10 ) {
      int sreg0 = ( ( numofbits - 3 ) << 1 ) | 0x01;  // Voltage calib disabled, n bits, calibrated value
      if ( sensor_sensorsetup( SENSOR_TEMP, REG_SREG0, sreg0 ) )
        return( delays[numofbits-3] );
    }
  return( -1 );
}

/**
* Converts the TEMP sensor value into degrees Celcius (as a float).
*/
float sensor_temp_convertdatatotemp( int data ) {
  int negative = ( data & 0x8000 );
  data &= 0x7FFF;
  float temp = (float)data / 64.0;  // 0x40;
  if ( negative ) temp = -temp;
  temp -= 273.15;
  return( temp );
}

// ============================================================================
// RH SPECIFIC FUNCTIONS
// ============================================================================

