samimasad/STE-LPC1768-/My_Example_With_Drivers/board/sensor.c
#define CALIB_OFFSET_RH   4
uint16_t c0[4], c1[4], c2[4], c3[4];

void sensor_rh_readcalib( int RhSensor ) {
  int addr = 0x40 + CALIB_OFFSET_RH + (4*RhSensor);
  sensor_readnvm( addr + 0, &c0[RhSensor] );
  sensor_readnvm( addr + 1, &c1[RhSensor] );
  sensor_readnvm( addr + 2, &c2[RhSensor] );
  sensor_readnvm( addr + 3, &c3[RhSensor] );
}

/**
* Set-up the RH sensor.
* - Assumes that calib parameters have been read into c0, c1, c2, c3
* - Returns the (expected) conversion time when started (or -1 on error).
* - For MIST1431, float conversion needs to take place from ftemp
* - For SenX00, the raw temp value is used without extra conversion
*/
int sensor_rh_setsensor( int RhSensor, float ftemp, int raw_temp ) {
  
  if ( mode == MODE_MIST1431 ) {
    sensor_sensorsetup( SENSOR_RH, REG_SREG0, 0xec07 ); // Resolution setup
  
    sensor_sensorsetup( SENSOR_RH, REG_SREG1, c0[RhSensor] );  // Calib
    sensor_sensorsetup( SENSOR_RH, REG_SREG2, c1[RhSensor] );  // Calib
    sensor_sensorsetup( SENSOR_RH, REG_SREG3, c2[RhSensor] );  // Calib
    sensor_sensorsetup( SENSOR_RH, REG_SREG4, c3[RhSensor] );  // Calib
  
    if ( ftemp < -200.0 ) ftemp = 25;        // If temp not available, then use 25 degrees Celsius
    sensor_sensorsetup( SENSOR_RH, REG_SREG5, HalfCompress( ftemp + 273.15 ) );  // Temp
  } else {
    sensor_sensorsetup( SENSOR_RH, REG_SREG0, c0[RhSensor] );  // Calib
    sensor_sensorsetup( SENSOR_RH, REG_SREG1, c1[RhSensor] );  // Calib
    sensor_sensorsetup( SENSOR_RH, REG_SREG3, c2[RhSensor] );  // Calib
    sensor_sensorsetup( SENSOR_RH, REG_SREG4, c3[RhSensor] );  // Calib

    if ( raw_temp == 0 ) raw_temp = 0x5CA8;  // If temp not available, then use 25 degrees Celsius
    sensor_sensorsetup( SENSOR_RH, REG_SREG5, raw_temp );  // Temp
  }
  
  sensor_sensorsetup( SENSOR_RH, REG_SREG6, ( 1 << RhSensor ) );  // Select
  
  return( 18 );
}

/**
* Converts the RH sensor value into % (as an integer).
* - Returns a value between [0-100%] (normally)
* - For MIST1431 and SenX00 different conversions are needed
*/
float sensor_rh_convertdatatohumidity( int RhSensor, int data ) {
  float rh;
  if ( mode == MODE_MIST1431 ) {
    rh = HalfDecompress( data );
  } else {
    if ( c0[RhSensor] & 0x20 ) {
      // Raw format
      rh = (float)data;     // Unknown what this means
    } else {
      if ( c0[RhSensor] & 0x10 ) {
        // unlimited, calibrated
        int sign = ( data & 0x8000 ) ? -1 : 1;
        data &= 0x7FFF;
//        rh = data >> 8;
        rh = (float)( data >> 8 );
        rh += (float)( data & 0xFF ) / 256.0f;
        rh *= sign;
      } else {
        // Limited, calibrated
//        rh = data >> 9;        
        rh = (float)( data >> 9 );
        rh += (float)( data & 0x1FF ) / 512.0;
      }
    }
  }
  
  sprintf( buf, "\r\nRh-raw (%d) 0x%x", RhSensor, data );
  //modem_debug( buf );
  console_uart_sendString( buf );
  
  return( rh );
}

// ============================================================================
// ALS SPECIFIC FUNCTIONS
// - We have 12 sensors:
//   0 -  5: Red + Blue sensor
//   6 - 11: Red sensor only
// ============================================================================

#define CALIB_OFFSET_ALS_MIST_R  0x54

#define CALIB_OFFSET_ALS_SEN_OP  0x54
#define CALIB_OFFSET_ALS_SEN_R   0x66      // R
#define CALIB_OFFSET_ALS_SEN_RB  0x69      // R+B

uint16_t m[6], n[6], opmode[6], int_time[6], int_cal[6];
uint16_t defaultm[6]={0x56d,0x56d,0x502,0x501,0x513,0x4ee};

/**
* Read calibration parameters into global variables m, n, opmode, int_time and int_cal
* - NVM address differs per sensor
*/
void sensor_als_readcalib( int AlsSensor ) {
  int addr;
  int rb = 1;
  if ( AlsSensor >= 6 ) { rb = 0; AlsSensor -= 6; }   // 0-5 = R+B; 6-11 = RED
  
  if ( mode != MODE_MIST1431 ) {
    addr = CALIB_OFFSET_ALS_SEN_OP;
    addr += ( 3 * AlsSensor );
    sensor_readnvm( addr + 0, &opmode[AlsSensor] );
    if (!opmode[AlsSensor]) {
      opmode[AlsSensor]=0xe1;
      sprintf( buf, "\r\nOpmode not found, use default %x", opmode[AlsSensor] );
      //modem_debug( buf );
      console_uart_sendString( buf );
    }
    sensor_readnvm( addr + 1, &int_time[AlsSensor] );
    sensor_readnvm( addr + 2, &int_cal[AlsSensor] );
    if (!int_cal[AlsSensor]) {
      int_cal[AlsSensor]=0x09;
      sprintf( buf, "\r\nCal not found, use default %x", int_cal[AlsSensor] );
      //modem_debug( buf );
      console_uart_sendString( buf );
    }
  }
  
  if ( mode == MODE_MIST1431 ) addr = CALIB_OFFSET_ALS_MIST_R;
  else addr = CALIB_OFFSET_ALS_SEN_R;

  if ( rb ) addr += 3;   // R+B values are 3 positions further
  
  addr += ( 6 * AlsSensor );
  sensor_readnvm( addr + 1, &m[AlsSensor] );
  if (!m[AlsSensor]) {
    m[AlsSensor]=defaultm[AlsSensor];
    sprintf( buf, "\r\nM not found, use default %d", m[AlsSensor] );
    //modem_debug( buf );
    console_uart_sendString( buf );
  }
  sensor_readnvm( addr + 0, &n[AlsSensor] );
  if (!n[AlsSensor]) {
    n[AlsSensor]=1;
    sprintf( buf, "\r\nN not found, use default %d", n[AlsSensor] );
    //modem_debug( buf );
    console_uart_sendString( buf );
  }
}

/**
* Set-up the ALS sensor.
* - Returns the (expected) conversion time when started (or -1 on error).
*/

//                        0   1   2    3    4    5    6    7
int integrationtime[] = { 16, 16, 20, 100, 200, 400, 400, 400 };

int sensor_als_setsensor( int AlsSensor ) {
  int sreg0;
  int rb = 1;
  if ( AlsSensor >= 6 ) { rb = 0; AlsSensor -= 6; }
  
  if ( mode == MODE_MIST1431 ) {
    // sreg0 = 0xe1;  // Enable diode, gain=1, start
    sreg0 = 0xe1;  // Enable diode, gain=1, start
    // sreg0 = 0xe5;  // Enable diode, gain=1, start
    // sreg0 = 0xe3;
    // sreg0 = 0xa3;  // Enable diode, gain=1, start
  } else {
    // sreg0 = 0xE1;   // 11100011
    sreg0 = opmode[AlsSensor];   // 11100011
  }
  sensor_sensorsetup( SENSOR_ALS, REG_SREG0, sreg0 );
  
  if ( mode != MODE_MIST1431 ) {
    // sensor_sensorsetup( SENSOR_ALS, REG_SREG1, 0x000d );
    // sensor_sensorsetup( SENSOR_ALS, REG_SREG2, 0x009d );
    sensor_sensorsetup( SENSOR_ALS, REG_SREG1, int_time[AlsSensor] );
    sensor_sensorsetup( SENSOR_ALS, REG_SREG2, int_cal[AlsSensor]  );
  }
  
