samimasad/STE-LPC1768-/My_Example_With_Drivers/board/sensor.c
  if ( mode == MODE_MIST1431 ) {
    // Due to a bug in the current silicon, the ALS diode mux has been reversed
    AlsSensor = 5 - AlsSensor;
  }
  
  int sreg6 = ( 1 << AlsSensor );
  if ( rb ) sreg6 |= 0x40;
  sensor_sensorsetup( SENSOR_ALS, REG_SREG6, sreg6 );
  
  // Return integration time
  return( integrationtime[ sreg0 & 0x07 ] );
}

/**
* Convert the ALS sensor value into a LUX value.
* - Assumes that calib parameters have been read
*/

////                0      1     2     3      4       5      6
//// Int.times:   notsup. 16ms  20ms  100ms  200ms  400ms  notsup.
//float if2h[] = {   1.0, 32.1, 38.5, 192.5,  385,   760,   1.0 };
//float if2n[] = {   1.0,  1.0,  1.2,  5.9,  11.9,  23.8,   1.0 };
//
//float if1h[] = {   1.0, 10.2, 14.3, 89.7,   198,   358,   1.0 };
//float if1n[] = {   1.0,  1.0,  1.2,  3.4,   6.5,  16.9,   1.0 };

//                0        1        2        3         4         5       6
// Int.times:   notsup.  16ms      20ms    100ms     200ms     400ms   notsup.
float if2h[] = {   1.0,  1.0,     1.2007,  6.0051,  12.0056,  23.8805,  1.0 };
float if2n[] = {   1.0,  0.0267,  0.0321,  0.1606,   0.3215,  0.6427,   1.0 };

float if1h[] = {   1.0,  1.0,     1.1955,  5.8351,  11.7510,  25.2164,  1.0 };
float if1n[] = {   1.0,  0.0373,  0.0431,  0.1692,   0.3245,   0.6444,  1.0 };

float sensor_als_convertdatatolux( int AlsSensor, int data ) {
  float lux;
  int rb = 1;
  if ( AlsSensor >= 6 ) { rb = 0; AlsSensor -= 6; }
  
  //if ( m[AlsSensor] == 0 || n[AlsSensor] == 0 ) modem_error( "no als m+n" );
  if ( m[AlsSensor] == 0 || n[AlsSensor] == 0 ) console_uart_sendString(  "\r\nno als m+n" );
  
  int ls_gain = ( opmode[AlsSensor] & ( 1 << 6 ) ) != 0;
  int ls_time = opmode[AlsSensor] & 0x07;
  
  sprintf( buf, "\r\nM=%d, N=%d, G=%d, T=%d", m[AlsSensor], n[AlsSensor], ls_gain, ls_time );
  //modem_debug( buf );
  console_uart_sendString( buf );

  // Old formula
  //  lux = (data * 8750) / m[AlsSensor] + n[AlsSensor];
  //  sprintf( buf, "Old lux %d", (int)lux );
  //  modem_debug( buf );

  // New formula
  // lux = (float)(data * 11997) / (float)m[AlsSensor];
  lux = (float)(data * 1200) / (float)m[AlsSensor];
  
  if ( ls_gain == 0 ) {
    // Bit6 is 0: HIGH gain
    lux -= (float)n[AlsSensor] * if1h[ls_time];
    lux /= if2h[ls_time];
  } else {
    // Bit6 is 1: NORMAL gain
    lux -= (float)n[AlsSensor] * if1n[ls_time];
    lux /= if2n[ls_time];
  }
  
  return( lux );
}

// ============================================================================
// Startup / switchoff
// ============================================================================

/**
* Performs standard startup sequence
*/
void sensor_active( void ) {
#if 0
  // Reset MIST
  sensor_hardreset( 1 );
  vTaskDelay(2);
  sensor_hardreset( 0 );
  
  // Reset MIST (again) in SW
  sensor_command_reset();
  
  // Enable analog power to sensors
  sensor_analogpower( 1 );
#else
  sensor_sensorreset( 1 );
  sensor_spichipselect(0);
  vTaskDelay(10);
  sensor_sensorreset( 0 );
  sensor_spichipselect(1);
  vTaskDelay(10);

  sensor_waitforinterrupt();
  //sensor_spichipselect(1);
  //sensor_spichipselect( 0 );
  //vTaskDelay(1);
  //sensor_spichipselect(1);
  sensor_spireceive16();
  //sensor_spichipselect( 0 );
  vTaskDelay(10);

  sensor_sensorreset( 1 );
  vTaskDelay(10);
  sensor_sensorreset( 0 );
  vTaskDelay(2);
  sensor_waitforinterrupt();
  sensor_spireceive16();

  //sensor_spichipselect(0);

  //sensor_spichipselect(1);
  //sensor_command_reset();
  //sensor_spichipselect(0);
 // sensor_spichipselect( 0 );

#endif
}

/**
* Performs standard switchoff sequence
*/
void sensor_inactive( void ) {
  // Stop and put MIST in reset (to save power)
  sensor_analogpower( 0 );
  //sensor_hardreset( 1 );
}

// ============================================================================
// Testing
// ============================================================================

//int sensor_testenable( void ) {
//  int cmd = ( CMD_TEST_ENABLE << 8 ) | 0;
//  int response = 0;
////  if ( sensor_sendcommand2( cmd, 0xff, 0xff, &response ) ) {
//  if ( sensor_sendcommand2( cmd, 0x00, 0x00, &response ) ) {
//    sprintf( buf, "Test enable: %s", response2text(response) );
//    modem_debug( buf );
//  } else {
//    sprintf( buf, "Test enable: %s", response2text(response) );
//    modem_debug( buf );
//  }
//  return( response == RSP_ACK );
//}
//
//int sensor_testdisable( void ) {
//  int cmd = ( CMD_TEST_DISABLE << 8 ) | 0;
//  int response = 0;
//  if ( sensor_sendcommand( cmd, &response ) ) {
//    sprintf( buf, "Test disable: %s", response2text(response) );
//    modem_debug( buf );
//  }
//  return( response == RSP_ACK );
//}

int sensor_testmodeunlocked( void ) {
  return( ( factory_status & ( 1 << 3 ) ) == 0 );
}

// ============================================================================
// Init
// ============================================================================

void sensor_init( void ) {
  int response;
  PINSEL_CFG_Type PinCfg;

  /*pins to be used :
   * P0.9 MOSI1 -> P5
   * P0.8 MISO1 -> P6
   * P0.7 SCK1  -> P7
   * P0.6 SSEL1 -> P8
   * P0.18 INT -> P11 //my board
   * P0.17 ENA -> P12 //my board
   * P0.0 ENA -> P9 //Stefan board
   * P0.1 INT -> P10 //Stefan board
   */
    PinCfg.OpenDrain = 0;
	PinCfg.Pinmode = PINSEL_PINMODE_PULLUP;
	PinCfg.Portnum = 0;
	PinCfg.Funcnum = 2;

	//PinCfg.Pinnum = 6;
	//PINSEL_ConfigPin(&PinCfg); //manually control CS
	PinCfg.Pinnum = 7;
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 8;
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 9;
	PINSEL_ConfigPin(&PinCfg);
#ifdef STEFAN_BOARD
	PinCfg.Funcnum = 0;
	PinCfg.Pinnum = 6; //manual CS
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 0;
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 1;
	PINSEL_ConfigPin(&PinCfg);
#else
	PinCfg.Funcnum = 0;
	PinCfg.Pinnum = 6; //manual CS
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 17;
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 18;
	PINSEL_ConfigPin(&PinCfg);
/*
	//just check if we can play around with the LEDs
	PinCfg.Pinnum = 16;
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 17;
	PINSEL_ConfigPin(&PinCfg);
	GPIO_SetDir(0, 1L<<15 , 1);
	GPIO_SetDir(0, 1L<<16 , 1);
	GPIO_ClearValue(0,(1L<<15)+(1L<<16));
	GPIO_SetValue(0,(1L<<15)+(1L<<16));
*/
#endif


  sensor_spiconfigure();
#if 0
  CLKOUTCLKSEL=0x03; // select main clock as src
  CLKOUTUEN=0x00; // apply clock selection
  CLKOUTUEN=0x01;
  CLKOUTDIV=0; // disable it for now
  IOCON_PIO0_1 = 0x01; // make P0.1 clkout pin
#endif


  sensor_active();
  sensor_sendcommand( CMD_SENSOR_MEASURE_DEFAULT << 8 | 0x10, &response );

  // mode=(response!=0x5555) ? MODE_SEN300 : MODE_MIST1431; 
#if 0
  if ( response == 0x5555 ) {
    mode = MODE_MIST1431;
  } else {
    // Unprogrammed (0000h, FFFFh) and !0200h == SEN300
    if ( nvm_readtype() != 0x0200 ) mode = MODE_SEN300;
    else mode = MODE_SEN200;
  }
#endif
  //sensor_inactive();
  
  // TODO
  // - Also distinguish between SEN200 and SEN300 by calling ALS function ....
}
